# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew install ack
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew install doctl
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew install ghostscript
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager #TODO Add a manual sign in in the app store
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew install zsh-autosuggestions


# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew services start php
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew install mailhog
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew services start mysql
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
brew install --cask alfred
brew intsall --cask atom
cask 'aerial'
cask 'caffeine'
brew install --cask coderunner
cask 'dbngin'
brew install --cask daisydisk
brew install --cask endnote
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
brew install --cask helo
brew install --cask horos
cask 'imageoptim'
cask 'insomnia'
brew install --cask jetbrains-toolbox
brew install --cask logitech-camera-settings
brew install --cask logitech-presentation
brew install --cask macvim
brew install --cask meshlab
brew install --cask microsoft-office
brew install --cask microsoft-teams
brew install --cask obs
brew install --cask opera
brew install --cask parallels
brew install --cask paw
cask 'pastebot'
brew install --cask postman
brew install --cask powershell
cask 'phpmon'
cask 'ray'
brew install --cask rectangle
cask 'screenflow'
cask 'signal'
brew install --cask skype
cask 'slack'
brew install --cask slicer
brew install --cask sourcetree
brew install --cask spotify
brew install --cask unity-hub
brew install --cask sequel-ace
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
brew install --cask tor-browser
cask 'transmission'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
brew install --cask webex
brew install --cask whatsapp
cask 'zoom'
brew install --cask zotero

echo 'Install some nice quicklook plugins'
echo '-----------------------------------'
brew install --force qlcolorcode qlstephen qlmarkdown quicklook-json qlprettypatch quicklook-csv betterzipql webp-quicklook suspicious-package
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
brew install font-roboto-mono-for-powerline
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

brew tap homebrew/cask-fonts
brew install --cask font-hack-nerd-font

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
#mas 'XCode', id: ....
#mas 'MS office'
#mas 'MSTeams'
mas 'OneNote'
mas 'Parcel', id: 375589283
mas 'TweetDeck', id: 485812721