# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'dnsmasq'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'ghostscript'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager #TODO Add a manual sign in in the app store
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php', restart_service: true
#brew services start php
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'mailhog'
brew 'meilisearch'
brew 'memcached'
brew 'mysql', restart_service: true
#brew services start mysql
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
# cask '1password'
cask '1password-beta'
cask '1password-cli'
cask 'alfred'
cask 'atom'
cask 'aerial'
cask 'amphetamine'
cask 'caffeine'
cask 'coderunner'
cask 'dbngin'
cask 'daisydisk'
cask 'endnote'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gimp'
cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'helo'
cask 'horos'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
#cask 'logitech-camera-settings'
cask 'logitech-presentation'
cask 'macvim'
cask 'meshlab'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'obs'
cask 'opera'
cask 'parallels'
cask 'paw'
cask 'pastebot'
cask 'postman'
cask 'powershell'
cask 'phpmon'
cask 'ray'
cask 'rectangle'
cask 'screenflow'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'slicer'
cask 'sourcetree'
cask 'spotify'
cask 'unity-hub'
cask 'sequel-ace'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'whatsapp'
cask 'zoom'
cask 'zotero'

#echo 'Install some nice quicklook plugins'
#echo '-----------------------------------'
#brew install --force qlcolorcode qlstephen qlmarkdown quicklook-json qlprettypatch quicklook-csv betterzipql webp-quicklook suspicious-package
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'quicklook-csv'
# cask 'betterzipql' does not exist
# cask 'webp-quicklook' does not exist
cask 'suspicious-package'

cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

#brew tap homebrew/cask-fonts
#cask 'font-hack-nerd-font'

# Mac App Store
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'XCode', id: ....
#mas 'MS office'
#mas 'MSTeams'
#mas 'OneNote'
#mas 'Parcel', id: 375589283
#mas 'TweetDeck', id: 485812721